#### Terraform Plan
```
Acquiring state lock. This may take a few moments...
module.s3.random_id.suffix: Refreshing state... [id=VaZdKw]
module.lambda.data.archive_file.lambda_zip["sentiment_analysis"]: Reading...
module.lambda.data.archive_file.lambda_zip["data_ingestion"]: Reading...
module.lambda.data.archive_file.lambda_zip["content_classification"]: Reading...
module.lambda.data.archive_file.lambda_zip["sentiment_analysis"]: Read complete after 0s [id=6462e8a22e71e75512ee96dffa052d015a1def37]
module.lambda.data.archive_file.lambda_zip["api_handler"]: Reading...
module.lambda.data.archive_file.lambda_zip["author_profiling"]: Reading...
module.lambda.data.archive_file.lambda_zip["data_ingestion"]: Read complete after 0s [id=68b37b0314f2f0e0172e5785cc4a3362946e3fd8]
module.lambda.data.archive_file.lambda_zip["engagement_scoring"]: Reading...
module.lambda.data.archive_file.lambda_zip["engagement_scoring"]: Read complete after 0s [id=a3a8448fcc68ef9e43a69043de878afca7e0e0dc]
module.lambda.data.archive_file.lambda_zip["trending_topics"]: Reading...
module.lambda.data.archive_file.lambda_zip["content_classification"]: Read complete after 0s [id=b1d0a838604524d911391be850e2c58962b4c395]
module.lambda.data.archive_file.lambda_zip["api_handler"]: Read complete after 0s [id=1005a5d8007079c7ace564e2a3da3d107fd9796f]
module.lambda.data.archive_file.lambda_zip["author_profiling"]: Read complete after 0s [id=af421ab358680112ce7f1f7edb73b9d3c32fddf6]
module.lambda.data.archive_file.lambda_zip["trending_topics"]: Read complete after 0s [id=cc377b3c5807084fc097f7c5bb18d1ed2f77ba1c]
module.lambda.aws_sqs_queue.dlq["author_profiling"]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/919399847940/reddit-analytics-prod-author_profiling-dlq]
module.eventbridge.aws_cloudwatch_event_rule.ingestion_schedule: Refreshing state... [id=reddit-analytics-prod-ingestion-schedule]
module.lambda.aws_sqs_queue.dlq["trending_topics"]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/919399847940/reddit-analytics-prod-trending_topics-dlq]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=reddit-analytics-prod-apigw-cloudwatch]
module.lambda.aws_sqs_queue.dlq["engagement_scoring"]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/919399847940/reddit-analytics-prod-engagement_scoring-dlq]
module.lambda.aws_sqs_queue.dlq["sentiment_analysis"]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/919399847940/reddit-analytics-prod-sentiment_analysis-dlq]
module.s3.aws_s3_bucket.raw: Refreshing state... [id=reddit-analytics-prod-raw-archive-55a65d2b]
module.lambda.aws_sqs_queue.dlq["content_classification"]: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/919399847940/reddit-analytics-prod-content_classification-dlq]
module.s3.aws_s3_bucket.artifacts: Refreshing state... [id=reddit-analytics-prod-artifacts-55a65d2b]
module.api_gateway.aws_cognito_user_pool.main: Refreshing state... [id=eu-west-2_gqi4vbWqB]
aws_kms_key.main: Refreshing state... [id=4d359a11-9ebb-4753-a138-a0a6051e985b]
module.lambda.aws_cloudwatch_log_group.lambda["trending_topics"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-trending_topics]
module.lambda.aws_cloudwatch_log_group.lambda["api_handler"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-api_handler]
module.lambda.aws_cloudwatch_log_group.lambda["author_profiling"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-author_profiling]
module.api_gateway.aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/apigateway/reddit-analytics-prod]
module.lambda.aws_cloudwatch_log_group.lambda["content_classification"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-content_classification]
module.lambda.aws_cloudwatch_log_group.lambda["data_ingestion"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-data_ingestion]
module.lambda.aws_cloudwatch_log_group.lambda["engagement_scoring"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-engagement_scoring]
module.lambda.aws_cloudwatch_log_group.lambda["sentiment_analysis"]: Refreshing state... [id=/aws/lambda/reddit-analytics-prod-sentiment_analysis]
module.kinesis.data.aws_region.current: Reading...
module.kinesis.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.api_gateway.aws_api_gateway_rest_api.main: Refreshing state... [id=k4hf8nzxoi]
module.iam.data.aws_iam_policy_document.lambda_assume: Reading...
module.iam.data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
module.iam.data.aws_caller_identity.current: Reading...
module.glue.aws_glue_catalog_database.main: Refreshing state... [id=919399847940:reddit_analytics_prod_db]
aws_cloudwatch_dashboard.main: Refreshing state... [id=reddit-analytics-prod]
module.kinesis.data.aws_iam_policy_document.firehose_assume: Reading...
module.kinesis.data.aws_iam_policy_document.firehose_assume: Read complete after 0s [id=414810265]
module.glue.data.aws_iam_policy_document.glue_assume: Reading...
module.glue.data.aws_iam_policy_document.glue_assume: Read complete after 0s [id=2681768870]
module.s3.aws_s3_bucket.processed: Refreshing state... [id=reddit-analytics-prod-processed-55a65d2b]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=reddit-analytics-prod-apigw-cloudwatch-20260301224404367400000001]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=919399847940]
module.api_gateway.aws_cognito_user_pool_client.api_client: Refreshing state... [id=18g17sp2pr934o37edkn80ijp]
aws_sns_topic.trending_spikes: Refreshing state... [id=arn:aws:sns:eu-west-2:919399847940:reddit-analytics-prod-trending-spikes]
aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:eu-west-2:919399847940:reddit-analytics-prod-alerts]
aws_kms_alias.main: Refreshing state... [id=alias/reddit-analytics-prod]
module.iam.aws_iam_role.trending: Refreshing state... [id=reddit-analytics-prod-trending]
module.iam.aws_iam_role.sentiment: Refreshing state... [id=reddit-analytics-prod-sentiment]
module.iam.aws_iam_role.consumer["engagement"]: Refreshing state... [id=reddit-analytics-prod-engagement]
module.iam.aws_iam_role.consumer["author-profiling"]: Refreshing state... [id=reddit-analytics-prod-author-profiling]
module.iam.aws_iam_role.consumer["classification"]: Refreshing state... [id=reddit-analytics-prod-classification]
module.iam.aws_iam_role.analytics_api: Refreshing state... [id=reddit-analytics-prod-analytics-api]
module.iam.aws_iam_role.ingestion: Refreshing state... [id=reddit-analytics-prod-ingestion]
module.kinesis.aws_iam_role.firehose: Refreshing state... [id=reddit-analytics-prod-firehose]
module.glue.aws_iam_role.glue: Refreshing state... [id=reddit-analytics-prod-glue]
module.kinesis.aws_kinesis_stream.analytics: Refreshing state... [id=arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-analytics]
module.kinesis.aws_kinesis_stream.raw_posts: Refreshing state... [id=arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-raw-posts]
module.dynamodb.aws_dynamodb_table.authors: Refreshing state... [id=reddit-analytics-prod-authors]
module.dynamodb.aws_dynamodb_table.engagement: Refreshing state... [id=reddit-analytics-prod-engagement]
module.dynamodb.aws_dynamodb_table.sentiment: Refreshing state... [id=reddit-analytics-prod-sentiment]
module.dynamodb.aws_dynamodb_table.raw_posts: Refreshing state... [id=reddit-analytics-prod-raw-posts]
module.dynamodb.aws_dynamodb_table.trending: Refreshing state... [id=reddit-analytics-prod-trending]
module.iam.data.aws_iam_policy_document.base: Reading...
module.iam.data.aws_iam_policy_document.base: Read complete after 0s [id=4046033837]
module.api_gateway.aws_api_gateway_resource.proxy: Refreshing state... [id=a64pvj]
module.api_gateway.aws_api_gateway_authorizer.cognito: Refreshing state... [id=0kda7f]
aws_sns_topic_subscription.email[0]: Refreshing state... [id=arn:aws:sns:eu-west-2:919399847940:reddit-analytics-prod-alerts:cba0cbf8-766e-40c9-97f8-17c6adba5f59]
module.s3.aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=reddit-analytics-prod-artifacts-55a65d2b]
module.s3.aws_s3_bucket_lifecycle_configuration.artifacts: Refreshing state... [id=reddit-analytics-prod-artifacts-55a65d2b]
module.s3.aws_s3_bucket_server_side_encryption_configuration.artifacts: Refreshing state... [id=reddit-analytics-prod-artifacts-55a65d2b]
module.s3.aws_s3_bucket_versioning.artifacts: Refreshing state... [id=reddit-analytics-prod-artifacts-55a65d2b]
module.s3.aws_s3_bucket_versioning.raw: Refreshing state... [id=reddit-analytics-prod-raw-archive-55a65d2b]
module.s3.aws_s3_bucket_server_side_encryption_configuration.raw: Refreshing state... [id=reddit-analytics-prod-raw-archive-55a65d2b]
module.s3.aws_s3_bucket_public_access_block.raw: Refreshing state... [id=reddit-analytics-prod-raw-archive-55a65d2b]
module.s3.aws_s3_bucket_lifecycle_configuration.raw: Refreshing state... [id=reddit-analytics-prod-raw-archive-55a65d2b]
module.iam.aws_iam_policy.base: Refreshing state... [id=arn:aws:iam::919399847940:policy/reddit-analytics-prod-lambda-base]
module.glue.aws_iam_role_policy_attachment.glue_service: Refreshing state... [id=reddit-analytics-prod-glue-20260301215425726900000001]
module.api_gateway.aws_api_gateway_method.proxy_any: Refreshing state... [id=agm-k4hf8nzxoi-a64pvj-ANY]
module.s3.aws_s3_bucket_server_side_encryption_configuration.processed: Refreshing state... [id=reddit-analytics-prod-processed-55a65d2b]
module.s3.aws_s3_bucket_versioning.processed: Refreshing state... [id=reddit-analytics-prod-processed-55a65d2b]
module.s3.aws_s3_bucket_public_access_block.processed: Refreshing state... [id=reddit-analytics-prod-processed-55a65d2b]
module.iam.aws_iam_role_policy_attachment.sentiment_base: Refreshing state... [id=reddit-analytics-prod-sentiment-20260301215447497700000006]
module.iam.aws_iam_role_policy_attachment.trending_base: Refreshing state... [id=reddit-analytics-prod-trending-20260301215447814100000008]
module.iam.aws_iam_role_policy_attachment.ingestion_base: Refreshing state... [id=reddit-analytics-prod-ingestion-20260301215447663700000007]
module.iam.aws_iam_role_policy_attachment.analytics_api_base: Refreshing state... [id=reddit-analytics-prod-analytics-api-20260301215446830900000002]
module.lambda.aws_s3_object.lambda_zip["api_handler"]: Refreshing state... [id=lambda/api_handler/api_handler-c101db552b47e6fb908f41c81f792415.zip]
module.lambda.aws_s3_object.lambda_zip["data_ingestion"]: Refreshing state... [id=lambda/data_ingestion/data_ingestion-5786235365094423e277cf33969f9152.zip]
module.lambda.aws_s3_object.lambda_zip["author_profiling"]: Refreshing state... [id=lambda/author_profiling/author_profiling-87492d0d05c0cd52be41c96060a5130e.zip]
module.lambda.aws_s3_object.lambda_zip["content_classification"]: Refreshing state... [id=lambda/content_classification/content_classification-ef61b601cecf87cb84bed1d8607ae48d.zip]
module.lambda.aws_s3_object.lambda_zip["engagement_scoring"]: Refreshing state... [id=lambda/engagement_scoring/engagement_scoring-c929819e041d6c014df571ad75e15098.zip]
module.lambda.aws_s3_object.lambda_zip["trending_topics"]: Refreshing state... [id=lambda/trending_topics/trending_topics-e485955c06e36fa7c83b13b30e6fba71.zip]
module.lambda.aws_s3_object.lambda_zip["sentiment_analysis"]: Refreshing state... [id=lambda/sentiment_analysis/sentiment_analysis-ef9f8a5ec236ced9156ea668146bd822.zip]
module.glue.aws_s3_object.etl_script: Refreshing state... [id=glue-scripts/reddit_etl.py]
module.iam.aws_iam_role_policy_attachment.consumer_base["classification"]: Refreshing state... [id=reddit-analytics-prod-classification-20260301215447158600000004]
module.iam.aws_iam_role_policy_attachment.consumer_base["engagement"]: Refreshing state... [id=reddit-analytics-prod-engagement-20260301215446984500000003]
module.iam.aws_iam_role_policy_attachment.consumer_base["author-profiling"]: Refreshing state... [id=reddit-analytics-prod-author-profiling-20260301215447327000000005]
aws_cloudwatch_metric_alarm.kinesis_iterator_age: Refreshing state... [id=reddit-analytics-prod-kinesis-iterator-age]
module.kinesis.data.aws_iam_policy_document.firehose_policy: Reading...
module.kinesis.data.aws_iam_policy_document.firehose_policy: Read complete after 0s [id=238623933]
module.kinesis.aws_kinesis_firehose_delivery_stream.to_s3: Refreshing state... [id=arn:aws:firehose:eu-west-2:919399847940:deliverystream/reddit-analytics-prod-firehose]
module.glue.aws_iam_role_policy.glue_s3: Refreshing state... [id=reddit-analytics-prod-glue:reddit-analytics-prod-glue-s3]
module.glue.aws_glue_job.etl: Refreshing state... [id=reddit-analytics-prod-etl]
module.glue.aws_glue_crawler.processed: Refreshing state... [id=reddit-analytics-prod-crawler]
module.kinesis.aws_iam_role_policy.firehose: Refreshing state... [id=reddit-analytics-prod-firehose:reddit-analytics-prod-firehose]
module.iam.aws_iam_role_policy.sentiment: Refreshing state... [id=reddit-analytics-prod-sentiment:reddit-analytics-prod-sentiment]
module.iam.aws_iam_role_policy.ingestion: Refreshing state... [id=reddit-analytics-prod-ingestion:reddit-analytics-prod-ingestion]
module.iam.aws_iam_role_policy.trending: Refreshing state... [id=reddit-analytics-prod-trending:reddit-analytics-prod-trending]
module.iam.aws_iam_role_policy.analytics_api: Refreshing state... [id=reddit-analytics-prod-analytics-api:reddit-analytics-prod-analytics-api]
module.iam.aws_iam_role_policy.consumer["author-profiling"]: Refreshing state... [id=reddit-analytics-prod-author-profiling:reddit-analytics-prod-author-profiling]
module.iam.aws_iam_role_policy.consumer["classification"]: Refreshing state... [id=reddit-analytics-prod-classification:reddit-analytics-prod-classification]
module.iam.aws_iam_role_policy.consumer["engagement"]: Refreshing state... [id=reddit-analytics-prod-engagement:reddit-analytics-prod-engagement]
module.lambda.aws_lambda_function.functions["data_ingestion"]: Refreshing state... [id=reddit-analytics-prod-data_ingestion]
module.lambda.aws_lambda_function.functions["engagement_scoring"]: Refreshing state... [id=reddit-analytics-prod-engagement_scoring]
module.lambda.aws_lambda_function.functions["sentiment_analysis"]: Refreshing state... [id=reddit-analytics-prod-sentiment_analysis]
module.lambda.aws_lambda_function.functions["trending_topics"]: Refreshing state... [id=reddit-analytics-prod-trending_topics]
module.lambda.aws_lambda_function.functions["author_profiling"]: Refreshing state... [id=reddit-analytics-prod-author_profiling]
module.lambda.aws_lambda_function.functions["api_handler"]: Refreshing state... [id=reddit-analytics-prod-api_handler]
module.lambda.aws_lambda_function.functions["content_classification"]: Refreshing state... [id=reddit-analytics-prod-content_classification]
module.api_gateway.aws_lambda_permission.api_gw: Refreshing state... [id=AllowAPIGatewayInvoke]
module.eventbridge.aws_cloudwatch_event_target.ingestion_lambda: Refreshing state... [id=reddit-analytics-prod-ingestion-schedule-ingestion-lambda]
module.api_gateway.aws_api_gateway_integration.lambda_proxy: Refreshing state... [id=agi-k4hf8nzxoi-a64pvj-ANY]
module.eventbridge.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
module.lambda.aws_lambda_event_source_mapping.kinesis["engagement_scoring"]: Refreshing state... [id=a15854ac-8cb6-4ff9-9e3f-f09330305985]
module.lambda.aws_lambda_event_source_mapping.kinesis["sentiment_analysis"]: Refreshing state... [id=007df13a-a4a2-49a4-8105-0a907f5c843b]
module.lambda.aws_lambda_event_source_mapping.kinesis["trending_topics"]: Refreshing state... [id=9ea8a8d0-d3a2-4a1c-b180-9b1fa1487560]
module.lambda.aws_lambda_event_source_mapping.kinesis["content_classification"]: Refreshing state... [id=d5fb9dd6-f526-466f-ad72-3a93c56e7855]
module.lambda.aws_lambda_event_source_mapping.kinesis["author_profiling"]: Refreshing state... [id=a0a801bf-b7bc-48ed-bc4d-c0f69c97770d]
module.api_gateway.aws_api_gateway_deployment.main: Refreshing state... [id=a4cyuw]
module.api_gateway.aws_api_gateway_stage.main: Refreshing state... [id=ags-k4hf8nzxoi-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_sns_topic_subscription.email[0] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "your-email@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:919399847940:reddit-analytics-prod-alerts"
    }

  # module.iam.aws_iam_role_policy.consumer["author-profiling"] will be updated in-place
  ~ resource "aws_iam_role_policy" "consumer" {
        id     = "reddit-analytics-prod-author-profiling:reddit-analytics-prod-author-profiling"
        name   = "reddit-analytics-prod-author-profiling"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "kinesis:GetRecords",
                            "kinesis:GetShardIterator",
                            "kinesis:DescribeStream",
                            "kinesis:ListShards",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-raw-posts",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "dynamodb:Query",
                          + "dynamodb:BatchWriteItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "comprehend:DetectEntities",
                          + "comprehend:BatchDetectEntities",
                            "comprehend:DetectKeyPhrases",
                          + "comprehend:BatchDetectKeyPhrases",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role_policy.consumer["classification"] will be updated in-place
  ~ resource "aws_iam_role_policy" "consumer" {
        id     = "reddit-analytics-prod-classification:reddit-analytics-prod-classification"
        name   = "reddit-analytics-prod-classification"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "kinesis:GetRecords",
                            "kinesis:GetShardIterator",
                            "kinesis:DescribeStream",
                            "kinesis:ListShards",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-raw-posts",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "dynamodb:Query",
                          + "dynamodb:BatchWriteItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "comprehend:DetectEntities",
                          + "comprehend:BatchDetectEntities",
                            "comprehend:DetectKeyPhrases",
                          + "comprehend:BatchDetectKeyPhrases",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role_policy.consumer["engagement"] will be updated in-place
  ~ resource "aws_iam_role_policy" "consumer" {
        id     = "reddit-analytics-prod-engagement:reddit-analytics-prod-engagement"
        name   = "reddit-analytics-prod-engagement"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "kinesis:GetRecords",
                            "kinesis:GetShardIterator",
                            "kinesis:DescribeStream",
                            "kinesis:ListShards",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-raw-posts",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "dynamodb:Query",
                          + "dynamodb:BatchWriteItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "comprehend:DetectEntities",
                          + "comprehend:BatchDetectEntities",
                            "comprehend:DetectKeyPhrases",
                          + "comprehend:BatchDetectKeyPhrases",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role_policy.ingestion will be updated in-place
  ~ resource "aws_iam_role_policy" "ingestion" {
        id     = "reddit-analytics-prod-ingestion:reddit-analytics-prod-ingestion"
        name   = "reddit-analytics-prod-ingestion"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "secretsmanager:GetSecretValue",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:secretsmanager:eu-west-2:*:secret:reddit-analytics/api-credentials*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (1 unchanged element hidden)
                            "dynamodb:UpdateItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role_policy.sentiment will be updated in-place
  ~ resource "aws_iam_role_policy" "sentiment" {
        id     = "reddit-analytics-prod-sentiment:reddit-analytics-prod-sentiment"
        name   = "reddit-analytics-prod-sentiment"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "dynamodb:PutItem",
                            "dynamodb:UpdateItem",
                            "dynamodb:BatchWriteItem",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:eu-west-2:919399847940:table/reddit-analytics-prod-raw-posts",
                            "arn:aws:dynamodb:eu-west-2:919399847940:table/reddit-analytics-prod-sentiment",
                            "arn:aws:dynamodb:eu-west-2:919399847940:table/reddit-analytics-prod-trending",
                            "arn:aws:dynamodb:eu-west-2:919399847940:table/reddit-analytics-prod-engagement",
                            "arn:aws:dynamodb:eu-west-2:919399847940:table/reddit-analytics-prod-authors",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (2 unchanged elements hidden)
                            "comprehend:DetectKeyPhrases",
                          + "comprehend:BatchDetectKeyPhrases",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_role_policy.trending will be updated in-place
  ~ resource "aws_iam_role_policy" "trending" {
        id     = "reddit-analytics-prod-trending:reddit-analytics-prod-trending"
        name   = "reddit-analytics-prod-trending"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "kinesis:GetRecords",
                            "kinesis:GetShardIterator",
                            "kinesis:DescribeStream",
                            "kinesis:ListShards",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kinesis:eu-west-2:919399847940:stream/reddit-analytics-prod-raw-posts",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "dynamodb:Query",
                          + "dynamodb:BatchWriteItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "comprehend:DetectKeyPhrases",
                          + "comprehend:BatchDetectKeyPhrases",
                            "comprehend:DetectEntities",
                          + "comprehend:BatchDetectEntities",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "sns:Publish",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:sns:eu-west-2:919399847940:reddit-analytics-prod-trending-spikes",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.lambda.aws_lambda_function.functions["engagement_scoring"] will be updated in-place
  ~ resource "aws_lambda_function" "functions" {
        id                             = "reddit-analytics-prod-engagement_scoring"
      ~ last_modified                  = "2026-03-03T21:55:16.000+0000" -> (known after apply)
      ~ s3_key                         = "lambda/engagement_scoring/engagement_scoring-c929819e041d6c014df571ad75e15098.zip" -> "lambda/engagement_scoring/engagement_scoring-9493bf39d3efe2717710f4bb18d46bfd.zip"
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_s3_object.lambda_zip["engagement_scoring"] must be replaced
+/- resource "aws_s3_object" "lambda_zip" {
      + acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::reddit-analytics-prod-artifacts-55a65d2b/lambda/engagement_scoring/engagement_scoring-c929819e041d6c014df571ad75e15098.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "c929819e041d6c014df571ad75e15098" -> "9493bf39d3efe2717710f4bb18d46bfd"
      ~ id                     = "lambda/engagement_scoring/engagement_scoring-c929819e041d6c014df571ad75e15098.zip" -> (known after apply)
      ~ key                    = "lambda/engagement_scoring/engagement_scoring-c929819e041d6c014df571ad75e15098.zip" -> "lambda/engagement_scoring/engagement_scoring-9493bf39d3efe2717710f4bb18d46bfd.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ version_id             = "gxN2KnFzaQvpw0hXgmtprzRDUSCik.2L" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 7 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Pushed by: @bennymaliti, Action: pull_request*